Revit 2027 API
ExecutedEventArgs.GetJournalData Method
 Gets the journal data associated to this command (on journal playback).
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<string, string> GetJournalData()
Public Function GetJournalData As IDictionary(Of String, String)
public:
IDictionary<String^, String^>^ GetJournalData()
member GetJournalData : unit -> IDictionary<string, string>
Return Value
IDictionary<String, String>
Remarks
 For details about the use of journal data associated to a command, see ExternalCommandData.JournalData.
See Also
Reference
ExecutedEventArgs Class
Autodesk.Revit.UI.Events Namespace